snlkuharlocal/src/Documents/ЛистПереукладки/ЛистПереукладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистПереукладки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриОпределенииКоличестваМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииОтсканирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>EnumRef.РежимСканирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаАгрегацию</name>
    <type>
      <types>DocumentRef.ЗаданиеНаАгрегацию</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканировщикФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтклКонтрольНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолШтВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛСК</name>
    <type>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпайка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаСканирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиСотрудников</name>
    <attributes>
      <name>ВидОшибки</name>
      <type>
        <types>EnumRef.ВидыОшибокСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробокДляАгрегации</name>
    <attributes>
      <name>ИсходныйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокБлочков</name>
    <comment>заранее забронированные по ЗНА</comment>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/НомераКоробокПоЛистам/НомераКоробокПоЛистам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКоробокПоЛистам</name>
  <comment>по ЛП и Лн</comment>
  <resources>
    <name>Лист</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </resources>
  <resources>
    <name>НомерСтрокиЛН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистПереукладки/ObjectModule.bsl
Перем НужноВыгружать;
Перем ПростоЗаписывать; 
Процедура ПростоЗаписать()  экспорт
	ПростоЗаписывать=Истина;
	Записать();
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ПростоЗаписывать = Истина тогда
		Возврат;
	КонецЕсли;
	
	если ТипШК=Перечисления.ТипыШтрихКодов.ПустаяСсылка() тогда
		ТипШК=Перечисления.ТипыШтрихКодов.Штука;
	КонецЕсли;
	
	если ОбъемДокумента = 0 тогда
		ОбъемДокумента=ТипКороба.Объем;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Склад) Тогда
	
		Если ЕстьРеквизитДокумента("Склад",ДокОснование.Ссылка.Метаданные()) 
			И ЗначениеЗаполнено(ДокОснование.Склад) Тогда
			
			Склад = ДокОснование.Склад; 
			
		КонецЕсли;
		
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъемКоробов)
		ИЛИ ОбъемКоробов <>  ТипКороба.Объем Тогда
	
		ОбъемКоробов = ТипКороба.Объем; 
	
	КонецЕсли;
	
	если не ОбменДанными.Загрузка тогда
		если ОбъемДокумента= 0 тогда
			СообщитьИзМодуля("запрещён пустой объём в ЛП");
			Отказ=Истина;
		КонецЕсли;
		если не ЗначениеЗаполнено(ТипКороба) тогда
			СообщитьИзМодуля("запрещён пустой тип короба в ЛП");
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЭтоНовый() тогда
		Если НЕ (ДополнительныеСвойства.Свойство("НомерДокУстановлен") 
			И ДополнительныеСвойства.НомерДокУстановлен) Тогда 
			УстановитьНовыйНомер(СокрЛП(ДокОснование.Номер)+"/");
		КонецЕсли;
		ГруппыТоваров		=ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ НеУчитыватьПриОпределенииКоличестваМест И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		СформироватьШКЛистаПереукладки();
	КонецЕсли;	 
	
	КоличествоКоробок = 1;
	
	ПравилаАгрегацииЧестногоЗнака = ДокОснование.ПравилаАгрегацииЧестногоЗнака;
	Если ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияБлочков ИЛИ ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияКоробок  Тогда
		НеТребуетсяСканирование = Ложь;
	Иначе
		НеТребуетсяСканирование = Истина;
	КонецЕсли;
	
	КоличествоДокумента=Товары.Итог("Количество");
	
	ЕстьИзменения	= Модифицированность();
	

	если ШтрихкодыУпаковок.Количество() тогда
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|ГДЕ
		|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
		|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка <> &Ссылка
		|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки В(&ШтрихкодУпаковки)
		|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки <> &ПустойШК
		|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Дата >= &Дата";
		запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
		запрос.УстановитьПараметр("ссылка",Ссылка);	
		
		запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		запрос.УстановитьПараметр("Дата",Дата-3*86400);
		
		запрос.УстановитьПараметр("ШтрихкодУпаковки",ШтрихкодыУпаковок.Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки"));
		Выборка=запрос.Выполнить().Выбрать();
		
		если Выборка.Количество()>0 тогда
			ЗаписатьВЛог("Отладка",СтрШаблон("Найдены дубли кодов ЧЗ в ЛП в количестве %1",Выборка.Количество()),"Система");
		КонецЕсли;   
		
		МассивСообщений=новый Массив;
		пока Выборка.Следующий() цикл
			МассивСообщений.Добавить("Обнаружены дубли кодов в других ЛП - "+Выборка.Номер+"______"+Выборка.ШтрихкодУпаковки);
		КонецЦикла;
		если МассивСообщений.Количество()>0 тогда
			Сообщить(СтрСоединить(МассивСообщений,Символы.ПС));
			Отказ = Истина;
		КонецЕсли;

		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОснование);		
		
		если ЗначениеЗаполнено(КодАгрегации) тогда
			Запрос=новый запрос;
			запрос.Текст=  "ВЫБРАТЬ
			|	ЛистПереукладки.Ссылка.Номер КАК Ссылка
			|ИЗ
			|	Документ.ЛистПереукладки КАК ЛистПереукладки
			|ГДЕ
			|	ЛистПереукладки.Ссылка <> &Ссылка
			|	И ЛистПереукладки.КодАгрегации = &КодАгрегации
			|	И ЛистПереукладки.Дата >= &Дата
			|	И ЛистПереукладки.Проведен";
			запрос.УстановитьПараметр("Ссылка",Ссылка);
			запрос.УстановитьПараметр("КодАгрегации",КодАгрегации);
			запрос.УстановитьПараметр("Дата",Дата-14*86400);
			Выборка = запрос.Выполнить().Выбрать();  
			
			если Выборка.Количество()>0 тогда
				ЗаписатьВЛог("Отладка",СтрШаблон("Найдены дубли агрегационных кодов ЧЗ в ЛП в количестве %1",Выборка.Количество()),"Система");
			КонецЕсли;   
			
			пока Выборка.Следующий() цикл
				МассивСообщений.Добавить("Обнаружены дубли агрегационных кодов в других ЛП - "+Выборка.Номер);
			КонецЦикла;
		КонецЕсли;
		если МассивСообщений.Количество()>0 тогда
			отказ=Истина;
			СообщитьИзМодуля(СтрСоединить(МассивСообщений,символы.ПС));
			
		КонецЕсли;		  
	КонецЕсли;
	// Установка логирования для выявления проблемы при неправильном отображении печатной формы со штрихкодами по заказам FBS
	Попытка
		Если Не РольДоступна("Администратор")
			И ОбменМаркетПлейс.КонтрагентУчастникМаркетПлейса(ДокОснование.Контрагент, ДокОснование.ПунктДоставки) Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВложенныйЗапрос.Отсканировано КАК Отсканировано
			|ИЗ
			|	(ВЫБРАТЬ ПЕРВЫЕ 1
			|		ЛистПереукладкиТовары.Ссылка КАК Ссылка,
			|		ЛистПереукладкиТовары.Отсканировано КАК Отсканировано
			|	ИЗ
			|		Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
			|	ГДЕ
			|		ЛистПереукладкиТовары.Ссылка = &ЛистПереукладки) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
			|		ПО ВложенныйЗапрос.Ссылка = ЗаказКлиентаFBSТовары.ЛистПереукладки");
			Запрос.УстановитьПараметр("ЛистПереукладки", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Не РезультатЗапроса.Пустой() И Выборка.Следующий() Тогда
				Если Товары.Количество() > 0 И Выборка.Отсканировано > Товары[0].Отсканировано Тогда
					ЗаписатьВЛог("HELP_6552", СтрШаблон("Зафиксировано изменение количества отсканированного товара в меньшую сторону по ЛП № %1. %2", Номер, ТекущаяДатаСеанса()), "Предупреждение")
				КонецЕсли
			КонецЕсли
		КонецЕсли
	Исключение
		// Обработка исключения не обязательна
	КонецПопытки;

	Если ЗначениеЗаполнено(ДатаНачалаСканирования) 
		И НЕ ЗначениеЗаполнено(ДатаОкончанияСканирования)
		И Товары.Итог("Количество") = Товары.Итог("Отсканировано") 
		И (НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ВозвратВработу")
		ИЛИ ЭтотОбъект.ДополнительныеСвойства.ВозвратВработу = ЛОЖЬ) Тогда   
		ДатаОкончанияСканирования = ТекущаяДата();		
	КонецЕсли;
    //++Данилова Е.В. 07.05.2026 HELP-8363
	//Если НЕ Отказ
	//	И Проведен
	//	И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
	//	И (НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ВозвратВработу")
	//	ИЛИ ЭтотОбъект.ДополнительныеСвойства.ВозвратВработу = ЛОЖЬ)
	//	И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьИзОбработкиFBS")
	//	И Не ОтклКонтрольНоменклатуры Тогда 
	//	
	//	ЛПЗавершен = МаркировкаКС.ПроверитьЗавершениеЛП(ЭтотОбъект,ПравилаРаботыСАгрегациейЧЗ); 
	//	
	//	Если Завершен <> ЛПЗавершен Тогда
	//		
	//		Завершен = ЛПЗавершен; 
	//		
	//		Если Завершен Тогда
	//			НомерКоробкиНовый = Обработки.ПечатьЛистаНабора.ПолучитьНомерКоробкиПоЛистуПереукладки(ЭтотОбъект);
	//			Если НомерКоробкиНовый <> НомерКоробки Тогда
	//			
	//				НомерКоробки = 	НомерКоробкиНовый; 
	//			
	//			КонецЕсли;
	//			Сообщить(Строка(ссылка) + " завершен и доступен только для просмотра");	
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
    //--Данилова Е.В. 07.05.2026 
	Если Не Отказ 
		И (ПометкаУдаления 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		НомерКоробки = 0; 
		//++Данилова Е.В. 28.04.2026 HELP-9565 
		РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(ссылка); 
		//--Данилова Е.В. 28.04.2026
		//++Данилова Е.В. 19.05.2026  HELP-9825 перенесены в при записи 
		//++Данилова Е.В. 08.05.2026 HELP-9716 
		//Иначе 
		//	Если НЕ ЭтоНовый()
		//		И ЗначениеЗаполнено(ДокОснование)
		//		И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
		//		Обработки.ПечатьЛистаНабора.ПроверитьЗанятыеНомераБезЗаписиВЛист(ДокОснование,ссылка);
		//	КонецЕсли;
		//--Данилова Е.В. 08.05.2026 
		//--Данилова Е.В. 19.05.2026 
	КонецЕсли;
	//Валетов+ 04,06,2026 Проблема 0000000034
	Если НЕ Отказ И НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		ДополнительныеАгрегации = ШтрихкодыКоробокДляАгрегации.Количество() > 0;
	КонецЕсли;
	//Валетов-
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШК", Штрихкод);
	Запрос.УстановитьПараметр("ШКЛистаПереукладки", Штрихкод);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформацияШКЛП.ШК КАК ШК,
	|	ИнформацияШКЛП.ШКЛистаПереукладки КАК ШКЛистаПереукладки,
	|	ИнформацияШКЛП.Год КАК Год,
	|	ИнформацияШКЛП.Накладная КАК Накладная,
	|	ИнформацияШКЛП.НомерЛП КАК НомерЛП,
	|	ИнформацияШКЛП.ВидНакладной КАК ВидНакладной,
	|	ИнформацияШКЛП.НомерНакладной КАК НомерНакладной,
	|	ИнформацияШКЛП.Количество КАК Количество,
	|	ИнформацияШКЛП.ГруппыТоваров КАК ГруппыТоваров,
	|	ИнформацияШКЛП.Подразделение КАК Подразделение,
	|	ИнформацияШКЛП.КоличествоКоробок КАК КоличествоКоробок,
	|	ИнформацияШКЛП.НомерКоробки КАК НомерКоробки,
	|	ИнформацияШКЛП.НомерКоробкиЛП КАК НомерКоробкиЛП
	|ИЗ
	|	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
	|ГДЕ
	|	ИнформацияШКЛП.ШК = &ШК
	|	И ИнформацияШКЛП.ШКЛистаПереукладки = &ШКЛистаПереукладки";
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписиЖурнала = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	///////// НАКЛАДЫВАЕМ УПРАВЛЯЕМУЮ БЛОКИРОВКУ /////////////////////////////
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.ИнформацияШКЛП";
	ЭлементБлокировки.УстановитьЗначение("ШК", Штрихкод);
	ЭлементБлокировки.УстановитьЗначение("ШКЛистаПереукладки", Штрихкод);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	
	Если ЗаписиЖурнала.Количество() Тогда
		
		Попытка
			Блокировка.Заблокировать();
		Исключение
			СообщитьИзМодуля("Отмена проведения в Автоматическом режиме " + Строка(Ссылка));
		КонецПопытки;
		
		///////// НАКЛАДЫВАЕМ УПРАВЛЯЕМУЮ БЛОКИРОВКУ /////////////////////////////
		
		Для Каждого текЗаписьЖурнала Из ЗаписиЖурнала Цикл
			текЗапись = РегистрыСведений.ИнформацияШКЛП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(текЗапись, текЗаписьЖурнала);
			текЗапись.Удалить();
		КонецЦикла;
		
		ШКЛистаНабора="";
		
	КонецЕсли;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////

Процедура СформироватьШКЛистаПереукладки() Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	Если ПустаяСтрока(Штрихкод) Тогда	
		
		
		КоличествоСекунд=Формат(ТекущаяДата()- НачалоДня(ТекущаяДата()),"ЧЦ=5; ЧВН=");
		если КоличествоСекунд="" тогда 
			КоличествоСекунд="00000";
		КонецЕсли;	
		Штрихкод=Формат(ДеньГода(ТекущаяДата()),"ЧЦ=3; ЧВН=")+КоличествоСекунд+Прав(Номер,5);				 	 
		Штрихкод=Штрихкод+КонтрольныйСимволEAN(Штрихкод,14);
	КонецЕсли;
	//++Данилова Е.В. 28.05.2025 HELP-5109 ДЛЯ СКЛАДА НЕ НУЖНО, УБРАТЬ
	//НачатьТранзакцию();    
	НачатьТранзакцию();
	//--Данилова Е.В. 28.05.2025
	
	Если ПроведениеС.УправляемыйРежим() Тогда
	///////// НАКЛАДЫВАЕМ УПРАВЛЯЕМУЮ БЛОКИРОВКУ /////////////////////////////
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.ИнформацияШКЛП";
	ЭлементБлокировки.УстановитьЗначение("ШК", Штрихкод);
	ЭлементБлокировки.УстановитьЗначение("ШКЛистаПереукладки", Штрихкод);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	///////// НАКЛАДЫВАЕМ УПРАВЛЯЕМУЮ БЛОКИРОВКУ /////////////////////////////
	КонецЕсли;
	//Кухарь 29.03.17 конец
	НаборЗаписей = РегистрыСведений.ИнформацияШКЛП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ШК.Значение = Штрихкод;					 
	НаборЗаписей.Отбор.ШКЛистаПереукладки.Значение= Штрихкод;
	НаборЗаписей.Отбор.ШКЛистаПереукладки.Использование = Истина;
	НаборЗаписей.Отбор.ШК.Использование = Истина;
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.ШК = Штрихкод;
	запись.ГруппыТоваров=ГруппыТоваров;
	Запись.ШКЛистаПереукладки = Штрихкод;
	Запись.НомерЛП = Номер;
	Запись.ВидНакладной = ДокОснование.Метаданные().Синоним;
	Запись.НомерНакладной = ДокОснование.Номер;
	Запись.Количество = товары.Итог("Количество");
	Запись.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение;
	Запись.КоличествоКоробок = 1;
	запись.НомерКоробкиЛП = 1;
	Запись.НомерКоробки = 1;
	запись.Год=НачалоГода(ТекущаяДата());
	запись.Накладная=ДокОснование;
	//Кухарь 30.03.16 конец       
	НаборЗаписей.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьМаксимальныйНомерШКЛП(ПрефиксШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнформацияШКЛП.ШК КАК ШК
	|ИЗ
	|	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
	|ГДЕ
	|	ИнформацияШКЛП.ШК ПОДОБНО &ШК
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШК УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ШК",ПрефиксШК+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Число(Сред(Выборка.ШК,СтрДлина(ПрефиксШК)+1,13 - СтрДлина(ПрефиксШК)));	 
	Иначе
		Возврат Число(0);	 
	КонецЕсли;
КонецФункции

процедура ПрописатьНомераКоробокЛП()
	СтруктураРНК = Новый Структура;
	СтруктураРНК.Вставить("ДокОснование",Ссылка.ДокОснование);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &ДокОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛистПереукладки.Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ДокОснование",Ссылка.ДокОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Сч = 1;
	Пока Выборка.Следующий() Цикл
		ТекЛистПереукладки = Выборка.Ссылка;  
		Если ТекЛистПереукладки.Проведен = Ложь Тогда
			Продолжить;		
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.ИнформацияШКЛП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ШКЛистаПереукладки.Значение = ТекЛистПереукладки.Штрихкод;
		НаборЗаписей.Отбор.ШКЛистаПереукладки.использование = Истина;
		НаборЗаписей.Прочитать();
		СписокШК = Новый Соответствие;
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			СписокШК.Вставить(Запись.НомерКоробкиЛП,Запись.ШК);	 
		КонецЦикла;
		ТекШКЛистаПереукладки = ТекЛистПереукладки.Штрихкод;
		НовыйНаборЗаписей = РегистрыСведений.ИнформацияШКЛП.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.ШКЛистаПереукладки.Значение = ТекЛистПереукладки.Штрихкод;
		НовыйНаборЗаписей.Отбор.ШКЛистаПереукладки.использование = Истина;
		НовыйНаборЗаписей.Отбор.ШК.Значение = ТекШКЛистаПереукладки;
		НовыйНаборЗаписей.Отбор.ШК.использование = Истина;
		НовыйНаборЗаписей.Прочитать();
		Для Каждого Запись Из НовыйНаборЗаписей Цикл
			Запись.НомерКоробки = Сч;
		КонецЦикла;
		Сч = Сч + 1;
		НовыйНаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если Завершен И Проведен Тогда
		//+++Чирков 29.04.2026 - оказывается  есть проведенные ЛН к удаленным накладным ..... может и ЛП такие есть ......
		// которые еще и перезаписывают ..... их не надо регистрировать
		Если ПолучитьРеквизитШапки(ДокОснование, "Проведен") = Истина Тогда
			//---Чирков
			Если НЕ РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
				РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуПроверкиДокумента(Ссылка);			
			КонецЕсли;
			//+++Чирков 01.06.2026 MARK-3589
			МаркировкаС.ПроверитьКМпоДокументу(Ссылка, Новый Структура("ОтложеннаяПроверка", Истина));
			//---Чирков 01.06.2026
		КонецЕсли;
	Иначе
		//+++Чирков 29.04.2026 - MARK-3682
		Если РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.УдалитьЗаписиПоДокументу(Ссылка);
		КонецЕсли;
		//---Чирков 29.04.2026 - MARK-3682
	КонецЕсли;
	//++Данилова Е.В. 19.05.2026 HELP-9825 
	Если НЕ ЭтоНовый()
		И ЗначениеЗаполнено(ДокОснование)
		И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
		Обработки.ПечатьЛистаНабора.ПроверитьЗанятыеНомераБезЗаписиВЛист(ДокОснование,ссылка);
	КонецЕсли;
	//--Данилова Е.В. 19.05.2026 
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//++Данилова Е.В. 12.02.2026 SNL-131
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокОснование	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокументОснование");
		ДопПараметры	= ДанныеЗаполнения;
	Иначе		
		ДокОснование	= ДанныеЗаполнения;
		ДопПараметры		= Неопределено;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;
	ТипОснования 		= ТипЗнч(ДокОснование);
	Склад				= ДокОснование.Склад;
	//--Данилова Е.В. 12.02.2026 
	//++Данилова Е.В. 02.03.2026 SNL-153 
	ТипШК = перечисления.ТипыШтрихКодов.Штука; 
	//--Данилова Е.В. 02.03.2026 
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//++Данилова Е.В. 27.02.2026 SNL-150 
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;		
	
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Кельманов А.В. - SNL-119 - 2026.03.16 {
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьИзОбработкиFBS") Тогда
		// Кельманов А.В. - SNL-119 - 2026.03.16 }
		
		ДокОснованиеОбъект		=ДокОснование.ПолучитьОбъект();
		ВидДокументаОснования	=ДокОснование.Метаданные().Имя;
		
		ОбработкаСравненияЛН			= Обработки.СравнениеЛистовНабора.Создать();	
		ОбработкаСравненияЛН.Документ	= ДокОснование;
		ОбработкаСравненияЛН.СравнениеЛП = Истина; 
		
		Ошибки							= ОбработкаСравненияЛН.ПолучитьОшибкиНабораПоЛистамОбщий();		
		ЕстьОшибки						= Ошибки.Ошибки;
		
		Если (ЕстьОшибки 
			И Ошибки.Перебор)
			ИЛИ Не ЕстьОшибки Тогда
			Ошибки		= ОбработкаСравненияЛН.ПолучитьОшибкиНабора();		
			ЕстьОшибки	= Ошибки.Ошибки;
			
			// Кельманов А.В. - Исправление ошибки - 2026.05.19 {
			//Если ЕстьОшибки И Ошибки.ТП.Количество()>0 Тогда
			//	ОбработкаСравненияЛН.ВывестиТаблицуОшибок(Ошибки.ТП,"Перебор");	
			//КонецЕсли;
			#Если Клиент Тогда
				Если ЕстьОшибки И Ошибки.ТП.Количество()>0 Тогда
					ОбработкаСравненияЛН.ВывестиТаблицуОшибок(Ошибки.ТП,"Перебор");	
				КонецЕсли;
			#КонецЕсли
			// Кельманов А.В. - Исправление ошибки - 2026.05.19 } 
			
		КонецЕсли;	
		
		ДокОснованиеОбъект		= ДокОснование.ПолучитьОбъект();
		ЭтоУзел_ODN_или_OD7 = ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7();  
		
		Если ВидДокументаОснования="РасходнаяНакладная" Тогда		
			
			
			ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснованиеОбъект,Ошибки.КоличествоКоробок,Ошибки.ОбъемКоробов);  	
			
			
		КонецЕсли;
		
		Если ЭтоУзел_ODN_или_OD7
			И НЕ ЕстьОшибки Тогда   	
			
			Документы.ЛистПереукладки.ОбработатьПланНабора(ВидДокументаОснования,ДокОснование);
			
			//++Данилова Е.В. 27.04.2026 SNL-202
			
			// Кельманов А.В. - SNL-234 - 2026.05.15 {
			//Документы.ЛистПереукладки.ПроставитьКоличествоКоробокПоЗНА(ДокОснование); 
			Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроставлятьКоличествоКоробокПоЗНА") Тогда
				
				Документы.ЛистПереукладки.ПроставитьКоличествоКоробокПоЗНА(ДокОснование);
				
			КонецЕсли;
			// Кельманов А.В. - SNL-234 - 2026.05.15 }
			
			//--Данилова Е.В. 27.04.2026
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СверитьКолШтВКоробке() Экспорт

	Результат = МаркировкаКС.СтруктураРезультата(истина); 
	
	Если ОтклКонтрольНоменклатуры Тогда
		
		Если КолШтВКоробке <> Товары.Итог("Отсканировано") Тогда
			
			Результат.Успешно = Ложь; 
			Результат.Ошибки.Добавить("Не совпало расчётное количество шт. в коробе с фактическим"); 
			
		КонецЕсли;
		
		Возврат Результат; 
		
	Иначе 
		Возврат Результат; 
	КонецЕсли;

КонецФункции // СверитьКолШтВКоробке()
